#include <iostream>

/*
 Напишите функцию swapvec, принимающую std::vector<int> и указатель на массив переменных типа int (одного размера)
 и обменивающую значения этих массивов.
Пример:
std::vector<int> a = {1,2,3,4};
int b[] = {2,4,6,8};
swapvec(a,b);
for(int i = 0; i < 4; ++i)
   std::cout << a[i];
std::cout << std::endl;
for(int i = 0; i < 4; ++i)
   std::cout << b[i];

Вывод:
2468
1234
 */

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
