#include <iostream>

/*
Напишите рекурсивную функцию, которая принимает большое число n типа long long и переменную ans, а возвращает void.
После завершения работы функции в переменной ans должно оказаться количество чётных цифр в записи числа n.

Пример:
int ans;
evendigits(9 223 372 036 854 775 806, ans);
//ans == 10
Пояснение: 9 223 372 036 854 775 806
 */

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
