#include <iostream>

/*
Кролик сидит на нулевой ступеньке большой лестницы. Он может прыгать на 1, 2 или 3 ступеньки вверх.
Кролик хочет допрыгать до n-й ступеньки, но может сделать это большим количеством способов.
Напишите рекурсивную функцию, которая принимает число n типа int, а возвращает количество способов,
 которыми кролик может доскакать до n-й ступеньки.

Пример:
Ввод: 3
Вывод : 4
Пояснение: (3), (1,2), (2,1), (1,1,1)
 */

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
