#include <iostream>

/*
Кролик сидит на нулевой ступеньке большой лестницы. Он может прыгать на одну или более ступенек вверх, но не далее чем на k.
Кролик хочет допрыгать до n-й ступеньки, но может сделать это большим количеством способов.
Напишите рекурсивную функцию, которая принимает число n типа int и число k — максимальную длину прыжка,
 а возвращает количество способов, которым кролик может доскакать до n-й ступеньки.
Если максимальная длина прыжка не задана — считать её равной трём.

Пример:
Ввод: 3, 2
Вывод: 3
Пояснение: (1,2), (2,1), (1,1,1)
 */

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
